test/integration/helpers/fixtures/invoice-create.json

[
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/recipients",
        "body": {
            "type": "individual",
            "firstName": "Tom",
            "lastName": "Jones",
            "email": "testEmail@example.com",
            "address": {
                "street1": "123 Wolfstrasse",
                "city": "Berlin",
                "country": "DE",
                "postalCode": "123123"
            }
        },
        "status": 200,
        "response": {
            "ok": true,
            "recipient": {
                "id": "R-GZjaGyw8yQ2QLfKgrb5toN",
                "referenceId": "R-GZjaGyw8yQ2QLfKgrb5toN",
                "parentRecipientId": null,
                "email": "testEmail@example.com",
                "name": "Tom Jones",
                "lastName": "Jones",
                "firstName": "Tom",
                "legalName": "",
                "type": "individual",
                "status": "incomplete",
                "language": "en",
                "complianceStatus": "pending",
                "dob": null,
                "passport": "",
                "placeOfBirth": null,
                "updatedAt": "2023-03-10T05:44:58.748Z",
                "createdAt": "2023-03-10T05:44:58.748Z",
                "tags": [],
                "isPortalUser": false,
                "taxDeliveryType": "mail",
                "contactEmails": [],
                "occupation": "",
                "address": {
                    "street1": "123 Wolfstrasse",
                    "street2": "",
                    "city": "Berlin",
                    "postalCode": "123123",
                    "country": "DE",
                    "region": null,
                    "phone": "",
                    "phoneValidated": false
                },
                "compliance": {
                    "status": "pending",
                    "checkedAt": null
                },
                "gravatarUrl": "https://www.gravatar.com/avatar/47891e3b30e9fe3c5355801d4cbd5896?d=404",
                "governmentId": null,
                "ssn": null,
                "governmentIds": [],
                "birthplace": {
                    "country": null,
                    "region": null,
                    "city": null
                },
                "citizenships": [],
                "routeType": "sepa",
                "routeMinimum": "0",
                "estimatedFees": "5",
                "accounts": [],
                "payoutMethod": null,
                "primaryCurrency": null,
                "riskScore": null,
                "merchantId": "M-C7AsydAeAqW3husDNHSAND",
                "inactiveReasons": {
                    "primaryAccount": "missing"
                },
                "taxWithholdingPercentage": null,
                "taxForm": null,
                "taxFormStatus": null
            }
        },
        "rawHeaders": [
            "Date",
            "Fri, 10 Mar 2023 05:44:58 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "1230",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "600",
            "X-Rate-Limit-Remaining",
            "599",
            "X-Rate-Limit-Reset",
            "1678427158",
            "Vary",
            "Origin",
            "ETag",
            "W/\"4ce-9F3Gw0f5aZr+NiTrrbMuBQCvjMY\""
        ],
        "responseIsBinary": false
    },
    {
        "scope": "https://api.trolley.com:443",
        "method": "POST",
        "path": "/v1/invoices/create",
        "body": {
            "recipientId": "R-GZjaGyw8yQ2QLfKgrb5toN",
            "description": "Test Invoice",
            "externalId": "testInvoice",
            "invoiceDate": "2020-01-01",
            "dueDate": "2020-01-01"
        },
        "status": 200,
        "response": {
            "ok": true,
            "invoice": {
                "id": "I-XS4YquHtMeVBDvQQ76PAqw",
                "invoiceNumber": "",
                "description": "Test Invoice",
                "status": "open",
                "externalId": "testInvoice",
                "invoiceDate": "2020-01-01T00:00:00.000Z",
                "dueDate": "2020-01-01T00:00:00.000Z",
                "releaseAfter": null,
                "createdAt": "2023-03-10T05:44:59.086Z",
                "updatedAt": "2023-03-10T05:44:59.086Z",
                "totalAmount": {
                    "value": "0.00",
                    "currency": "CAD"
                },
                "paidAmount": {
                    "value": "0.00",
                    "currency": "CAD"
                },
                "dueAmount": {
                    "value": "0.00",
                    "currency": "CAD"
                },
                "tags": [],
                "lines": [],
                "recipientId": "R-GZjaGyw8yQ2QLfKgrb5toN",
                "syncDetails": null
            }
        },
        "rawHeaders": [
            "Date",
            "Fri, 10 Mar 2023 05:44:59 GMT",
            "Content-Type",
            "application/json; charset=utf-8",
            "Content-Length",
            "544",
            "Connection",
            "close",
            "Cache-Control",
            "no-store, no-cache",
            "Content-Security-Policy",
            "default-src 'self';base-uri 'self';block-all-mixed-content;font-src 'self' https: data:;frame-ancestors 'self';img-src 'self' data:;object-src 'none';script-src 'self';script-src-attr 'none';style-src 'self' https: 'unsafe-inline';upgrade-insecure-requests",
            "X-DNS-Prefetch-Control",
            "off",
            "Expect-CT",
            "max-age=0",
            "Strict-Transport-Security",
            "max-age=15552000; includeSubDomains",
            "X-Download-Options",
            "noopen",
            "X-Content-Type-Options",
            "nosniff",
            "X-Permitted-Cross-Domain-Policies",
            "none",
            "Referrer-Policy",
            "no-referrer",
            "X-XSS-Protection",
            "0",
            "Access-Control-Allow-Origin",
            "*",
            "X-Rate-Limit-Limit",
            "600",
            "X-Rate-Limit-Remaining",
            "598",
            "X-Rate-Limit-Reset",
            "1678427158",
            "Vary",
            "Origin",
            "ETag",
            "W/\"220-8CDMV4qcpUhPrv0WgK863ebHD0I\""
        ],
        "responseIsBinary": false
    }
]